examples/SOAP.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/04/secext" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exmpl="http://example.ru/ExampleService/">
  <soapenv:Header>
    <sec:Security>
      <ds:Signature>
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/>
          <ds:Reference URI="">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
              <ds:Transform Algorithm="http://www.w3.org/TR/1999/REC-xslt-19991116">
                <xslt:stylesheet xmlns:xslt="http://www.w3.org/1999/XSL/Transform" version="1.0">
                  <xslt:output method="xml" omit-xml-declaration="yes"/>
                  <xslt:strip-space elements="*"/>
                  <xslt:template match="@*|node()">
                    <xslt:copy>
                      <xslt:apply-templates select="@*|node()"/>
                    </xslt:copy>
                  </xslt:template>
                </xslt:stylesheet>
              </ds:Transform>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/>
            <ds:DigestValue/>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue/>
        <ds:KeyInfo>
          <ds:X509Data>
            <ds:X509Certificate/>
          </ds:X509Data>
        </ds:KeyInfo>
      </ds:Signature>
    </sec:Security>
  </soapenv:Header>
  <soapenv:Body>
    <exmpl:exampleMethod>
      <exmpl:exampleData>DataValue</exmpl:exampleData>
    </exmpl:exampleMethod>
  </soapenv:Body>
</soapenv:Envelope>
